Code/DataGeneration/openfoam/run/Channel_straight/0/U_original
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    bottom
    {
        type            zeroGradient;
    }

    left
    {
        type            noSlip;
    }
    
    top
    {
	type		uniformFixedValue;
    	uniformValue
    	{
		type			tableFile;
		format			csv;
		nHeaderLine		1;
		refColumn		0;
		componentColumns	(1 2 3);
		separator		",";
		mergeSeparators		no;
        	file			"inlet_v.csv";
    	}
    }

    right
    {
        type            noSlip;
    }

}

// ************************************************************************* //
