Code/DataGeneration/openfoam/run/Channel_straight/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 2 -1 0 0 0 0];

internalField   	uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    bottom
    {
	type		calculated;
	value		uniform 0;

    }

    left
    {
        type            nutkWallFunction;
	Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform 0;
    }

    top
    {
	type		calculated;
	value		uniform 0;
    }

    right
    {
        type            nutkWallFunction;
	Cmu		0.09;
	kappa		0.41;
	E		9.8;
	value		uniform 0;
    }
    
}

// ************************************************************************* //
