Code/DataGeneration/openfoam/run/Channel_straight/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back 
    {
        type            empty;
        physicalType    patch;
        nFaces          2364;
        startFace       3455;
    }
    front 
    {
        type            empty;
        physicalType    patch;
        nFaces          2364;
        startFace       5819;
    }
    left 
    {
        type            wall;
        physicalType    patch;
        nFaces          78;
        startFace       8183;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          13;
        startFace       8261;
    }
    right 
    {
        type            wall;
        physicalType    patch;
        nFaces          78;
        startFace       8274;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          13;
        startFace       8352;
    }
)

// ************************************************************************* //
