Code/DataGeneration/openfoam/run/Channel_straight/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default   	Euler;
}

gradSchemes
{
    default    	Gauss linear;
}

divSchemes
{
    default    			none;
    div(phi,U)  		Gauss linearUpwind grad(U);
    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
    div(phi,k)			Gauss linearUpwind default;
    div(phi,omega)		Gauss linearUpwind default;
}

laplacianSchemes
{
    default    	Gauss linear corrected;
}

interpolationSchemes
{
    default    	linear;
}

snGradSchemes
{
    default    	corrected;
}

wallDist
{
    method 	meshWave;
}


// ************************************************************************* //
